---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedWarning
source: html/de1c2939-4dcb-16a7-bc27-b448cb539ed6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedWarning Property

"In order to find a matching part, the fitting has to be connected to a pipe."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundDueToNoPipeConnectedWarning { get; }
```